# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [5]:
first = pd.Series(np.random.randint(1, high=5, size=100))
second = pd.Series(np.random.randint(1, high=4, size=100))
third = pd.Series(np.random.randint(10000, high=30000, size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [8]:
pd.concat([first, second, third], axis=1)

    0  1      2
0   4  3  29155
1   4  3  26204
2   1  2  21959
3   3  1  24304
4   2  1  23543
.. .. ..    ...
95  2  3  29043
96  2  1  16929
97  4  2  28154
98  1  3  28391
99  4  3  19512

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [9]:
bedrs, bathrs, price_sqr_meter = first, second, third

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [17]:
bigcolumn = pd.concat([bedrs, bathrs, price_sqr_meter], axis=0).to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       4
1       4
2       1
3       3
4       2
..    ...
95  29043
96  16929
97  28154
98  28391
99  19512

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [18]:
bigcolumn

        0
0       4
1       4
2       1
3       3
4       2
..    ...
95  29043
96  16929
97  28154
98  28391
99  19512

[300 rows x 1 columns]

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [22]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn # только это не знала остальное верно

         0
0        4
1        4
2        1
3        3
4        2
..     ...
295  29043
296  16929
297  28154
298  28391
299  19512

[300 rows x 1 columns]